[
  {
    "name": "Rob Edmonson",
    "date": "2025-05-29T18:20:03.000Z",
    "stars": 5,
    "title": "I am not new at marketing and business",
    "text": "I am not new at marketing and business. I started my first company when I was 22, Dropped out of college moved to Seattle And start from nothing. I've had several companies through my life. I am now 63 years old. The online marketing is a new turn for me. But all the business principles I have learned throughout my life still apply. I have course creator 360 and course creator pro. I wish that I had found them earlier Because I have spent 100 thousand  dollars Working with another coach company That has turned out to be smoke and mirrors. the wisdom and support I get from Stockton well back is second to none. the community is outstanding and their willingness to share and give feedback. they are saving me thousands of dollars per month by eliminating software stacking, and having everything integrated makes everything run seamlessly. One of the things I truly love about dealing with Stockton and course created 360 is they are on top of Everything that is coming out and teaching on how to utilize it. what I am learning and implementing into my company as far as artificial intelligence goes has truly revolutionized our whole process of business. Stockton and the course creator 360 Team have been The key to learning The ai process. I cannot Express how valuable my experience has been. if you are looking to run a business in today's economy and world of digital everything, you would be foolish not to sign up For a 30 day free trial an experience the learning and support you would get. I wish you well in your entrepreneurial adventures and hope you make the right choice to move forward and try course creator 360 for yourself. Phil Lerdahl",
    "avatar": "assets/images/avatars/65e114c9473bc60012683b16.png"
  },
  {
    "name": "Sheila Moreau",
    "date": "2025-05-29T01:45:21.000Z",
    "stars": 5,
    "title": "TRULY blown away by the customer service",
    "text": "Over the past year I have taken a course and how to develop a course, and I have purchased or joined four different platforms for course creation. Right before I'm launching my course I discovered Course Creator 360... within the past 48 hours they have gotten me on board they have done all the technology for me and the templates are so intuitive. I have gotten emails and texts with support and I also had a question that I clicked on chat and I didn't understand the response so the representative sent me a loom video showing how to do it within my own account! I am blown away by the customer service and I finally feel like the platform I'm using has support to help me succeed.",
    "avatar": "assets/images/avatars/6837a0098a5375898b54b824.png"
  },
  {
    "name": "Caroline",
    "date": "2025-05-28T21:24:32.000Z",
    "stars": 5,
    "title": "All the folks at CC360 have been so…",
    "text": "All the folks at CC360 have been so helpful!",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Paul Riddolls",
    "date": "2025-05-28T19:47:39.000Z",
    "stars": 5,
    "title": "Juan was fantastic",
    "text": "Juan was fantastic.  Amazing customer service.  Extremely knowledgable about CC360.The customer service from CC360 is the reason why i continue to use the service and signed up for 1 year.highly recommend",
    "avatar": "assets/images/avatars/68094d7a9db70e250d9e80e7.png"
  },
  {
    "name": "Elizabeth Tritsch",
    "date": "2025-05-28T19:25:43.000Z",
    "stars": 5,
    "title": "CC360 is always responsive, great price, so much included",
    "text": "CC360 is always responsive! Ray & Ken responded quickly to my questions this week. Truly love this CRM & it saves me so much money- so much is included and I no longer have to pay for numerous services! As it’s all included in CC360! Love the 2 x month coaching calls and system updates. Stockton loves giving us so much - a true value.",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "R Scott",
    "date": "2025-05-27T00:49:31.000Z",
    "stars": 5,
    "title": "Victor was very good and answered all…",
    "text": "Victor was very good and answered all my questions,",
    "avatar": "assets/images/avatars/680190bea8b3e6f5319f1acb.png"
  },
  {
    "name": "Colin Slaven",
    "date": "2025-05-23T05:30:11.000Z",
    "stars": 5,
    "title": "Ray was absolutely awesome",
    "text": "Ray was absolutely awesome. Very knowledgeable about the platform. Answered every single one of our questions. We were even more excited about the platform after the phone call with him than beforehand. Our long search to Narnia and back has finally come to end end as we have found the perfect platform for our businesses. 👍👍👍.",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Evelyn Plácido",
    "date": "2025-05-23T00:20:18.000Z",
    "stars": 5,
    "title": "The best onboarding experience",
    "text": "I felt very welcomed on the onboarding call. Viktor went above and beyond to help me with an issue I was having for a long time with my domain. I really appreciated his help.",
    "avatar": "assets/images/avatars/682fa3194e662d3139206e28.png"
  },
  {
    "name": "Zena B",
    "date": "2025-05-22T17:49:08.000Z",
    "stars": 5,
    "title": "All in One Platform",
    "text": "Onboarding with Juan was quick and kickstarted my path to course creation! CC360 is the best all in one platform to create and market your courses! Highly recommend.",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Jodi",
    "date": "2025-05-22T00:20:05.000Z",
    "stars": 5,
    "title": "Thank you Hamza",
    "text": "I love this program. What a generous group of people. And always there to help you out. I had a billing issue and within 24 hours they had it fixed. I am always impressed with how much you can do with cc360. I don’t need any of my other applications. Thanks to Hamza for helping me so much today!!!",
    "avatar": "assets/images/avatars/68110c8775d9811eb572733c.png"
  },
  {
    "name": "Mathis Kennington",
    "date": "2025-05-21T19:50:27.000Z",
    "stars": 5,
    "title": "I can always count on rapid responses…",
    "text": "I can always count on rapid responses and very competent help from the CC360 team. Couldn’t be more pleased with their support.",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Nicole Johnson",
    "date": "2025-05-21T00:11:13.000Z",
    "stars": 5,
    "title": "I had a question about the affiliate…",
    "text": "I had a question about the affiliate program today - and Ray was AMAZING!! Not only did he help me with the original question - but he went above and beyond to help me take a few things to the next level.",
    "avatar": "assets/images/avatars/67dc1da7aa1298c2c4e90234.png"
  },
  {
    "name": "Paula Stewart",
    "date": "2025-05-20T19:53:22.000Z",
    "stars": 5,
    "title": "Outstanding Creator Tool",
    "text": "Excellent and consistent support. Pre-made and valuable funnels, communities, site sections, and branding. Sharing of high-value design components and code as part of your subscription.",
    "avatar": "assets/images/avatars/682cc1882824b5123eee0a31.png"
  },
  {
    "name": "katiekaute",
    "date": "2025-05-20T19:15:04.000Z",
    "stars": 5,
    "title": "Brilliant piece of software",
    "text": "Such a brilliant piece of software. User friendly and a big variety of options for customisation. The videos are so helpful as are the support team. They're very knowledgeable, friendly and always on hand to help. Very impressed and would highly recommend",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Jackie Marvin",
    "date": "2025-05-20T18:44:35.000Z",
    "stars": 5,
    "title": "This Company turns YOU from a beginner to a PRO with their amazing help and software",
    "text": "For a lay person with no web developing skills, this company is changing my life by supporting me 24/7 with all of my questions with live humans (such a WOW for me !!), with tremendous step by step online videos as well to lead you by the hand developing your dream website, funnel, app, creating fantastic digital courses that are so intuitive and easy -I could build it in my sleep ! The value is tremendous ! I was with another company before who was just helping me develop an app, double the monthly payments- with spotty help, no one to guide you and no response to your support questions.. I felt so frustrated and lost. Then I found CC 360 & I had a guide, support, a map, and step by step directions. HUGE !! You will be so happy you signed up with them. I promise it will be everything you wished for & more !!",
    "avatar": "assets/images/avatars/65d3bd44a547e40012c68599.png"
  },
  {
    "name": "Jordan Saltmarsh",
    "date": "2025-05-20T17:20:08.000Z",
    "stars": 5,
    "title": "Love CC360",
    "text": "Love CC360! Best software around--Nora has been incredibly helpful with many of my questions! Definitely check them out!",
    "avatar": "assets/images/avatars/682c9d9b2824b5b486edcdde.png"
  },
  {
    "name": "Bálint Klinger",
    "date": "2025-05-20T15:19:48.000Z",
    "stars": 5,
    "title": "Things are getting together",
    "text": "Things are getting together! Nora was a great help in making videos for me and explaining how the system works, very quick and patient. Fantastic team!",
    "avatar": "assets/images/avatars/67e2e2065ee275ccef77e165.png"
  },
  {
    "name": "Raven Ramcharita",
    "date": "2025-05-20T05:08:46.000Z",
    "stars": 5,
    "title": "The software is excellent",
    "text": "The software is excellent. Able to host all my course needs, landing page/funnel building and that's just scratching a bit of what it can do when it comes to CRM management. The staff is super awesome; always willing to help out with any difficulties. Highly recommend the software and checkout their Course Creator Pro program as well.",
    "avatar": "assets/images/avatars/682bf2305ad665127653dc2b.png"
  },
  {
    "name": "Sarah Myriam",
    "date": "2025-05-19T20:09:08.000Z",
    "stars": 5,
    "title": "Been trying to get my own course out…",
    "text": "Been trying to get my own course out there for the last few years and seemed like something always got in the way, despite paying for expensive coaching sessions with sought after mindset coaches. Finally, decided I need to do this so I decided to give CC360 a try. They were extremely responsive and helpful getting my course website set up within 24 hrs. They provided me with impressive market research that validated the need for my course in the market and the market projections. This also gave me clarity in terms of messaging. A ton more clarity then numerous sessions with expensive coaches! They were courteous and helpful, walking me through the onboarding process, and so so patient with me! This was the boost I needed to get out of the rut/block I was in! Thank you!",
    "avatar": "assets/images/avatars/66d79b361d2bcc2f0d0a4558.png"
  },
  {
    "name": "Andrew Gibler",
    "date": "2025-05-16T03:41:15.000Z",
    "stars": 5,
    "title": "Always have a fantastic experience on…",
    "text": "Always have a fantastic experience on course creator 360 with their 24 hour support. As I am not in a typical time zone, I was doubtful, but they are always so fast to fixing issues and answering questions in a polite manner.",
    "avatar": "assets/images/avatars/67adc833d7c72998f6172a8f.png"
  },
  {
    "name": "Ray Pryor",
    "date": "2025-05-15T21:00:07.000Z",
    "stars": 5,
    "title": "Jackpot!",
    "text": "I've been thinking about launching a course for years, but now I'm actually making it happen. One HUGE hurdle for me was the tech stack. I was prepared for the drama of managing multiple vendors for landing page, email, ecomm, community, etc., but then I found CC360, which for me, is a jackpot. It has everything I need and then some. Now that would be great on its own, but the support is super awesome. A couple days ago I had a walk-through demo that was great. LOL when you sign up they kinda pester you do an onboarding call and now I see why. I just got done with mine. Juan Ossa setup all my domains, emails, and answered my questions. I have a web development background so I *could* have done the setup myself, but it's soooo much faster and easier when someone just handles it for you. DONE and done. Now I'm ready to get to work. So far CC360 seems to be like a great investment for me. I am one happy camper.",
    "avatar": "assets/images/avatars/682639ae75d981904f89448f.png"
  },
  {
    "name": "Leslie Cole",
    "date": "2025-05-15T19:21:39.000Z",
    "stars": 5,
    "title": "Juan was awesome",
    "text": "Juan was awesome! this program is beyond user friendly!  I learned so much in the last four days than in the last year building out my own CRM which I do not recommend.  CC 360 has done the hard work for you! My head was blown away when my course scoured and 85% !! as a market trending resource needed in the marketplace.  Thanks CC360 I was just about to give up!",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Mustafa Abdalla",
    "date": "2025-05-15T15:03:54.000Z",
    "stars": 5,
    "title": "cc360 has unlocked for me possibilities…",
    "text": "cc360 has unlocked for me possibilities beyond just a course creator. As a teacher, I am now capable to have live and 1to1 sessions with students without having to integrate calendly or other tools. Also, the guidance, tools and assistance are miles ahead compared to other platforms. The fact that you are guided from start to the finish line with success is a gem.I cannot appreciate cc360 enough!",
    "avatar": "assets/images/avatars/6825e6344db5a0541af860ac.png"
  },
  {
    "name": "David",
    "date": "2025-05-13T19:59:51.000Z",
    "stars": 5,
    "title": "Game-Changer for Digital Course Creators",
    "text": "Course Creator 360 has been an absolute game-changer for my business. As someone building out digital courses and AI-driven SaaS products, I needed a platform that could handle everything—checkout, integrations, email automation, and user access—all in one place. Not only did CC360 deliver, but their support team has been responsive and incredibly helpful whenever I hit a roadblock.  Highly recommended for any entrepreneur or educator serious about creating a professional online course experience.",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Rachel.flatt",
    "date": "2025-05-12T22:42:48.000Z",
    "stars": 5,
    "title": "I love CC360",
    "text": "I love using CC360! And their customer support is unmatched! No other platform offers as much integration and key features as CC360. Highly recommend:)",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Oscar Ibars",
    "date": "2025-05-09T19:48:19.000Z",
    "stars": 5,
    "title": "CC360 Customer Support is the GEM!",
    "text": "Honestly, customer support is the GEM of CC360. It's an extremely powerful CRM of tremendous value, but wow... the customer support is the best value-add of the whole stack. I've worked with amazing talent like Salman, Nora, and Victor hand-in-hand to build my program. I couldn't have done it without them. Thank you CS team!!",
    "avatar": "assets/images/avatars/63eb05abeaecf70012c888fe.png"
  },
  {
    "name": "Parker Walbeck",
    "date": "2025-05-09T02:33:22.000Z",
    "stars": 5,
    "title": "Blown away",
    "text": "Truly, an incredible experience. The market research report that was created for me absolutely blew my mind and then to be able to see it turned into a course outline, made me really believe in the future of this company.",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "L.K.Hill, Author",
    "date": "2025-05-09T01:52:15.000Z",
    "stars": 5,
    "title": "Ray was super helpful and took care of…",
    "text": "Ray was super helpful and took care of me right away. Fast and excellent customer service!",
    "avatar": "assets/images/avatars/681d43a6b83f2c143775e1bd.png"
  },
  {
    "name": "Matt Kalb",
    "date": "2025-05-08T22:44:00.000Z",
    "stars": 5,
    "title": "Hamza was incredibly helpful today",
    "text": "Hamza was incredibly helpful today! He went above and beyond to make sure everything was taken care of quickly and smoothly. Really appreciated the friendly and professional support. Thanks, Hamza!",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Steph",
    "date": "2025-05-08T21:45:14.000Z",
    "stars": 5,
    "title": "One Stop Shop",
    "text": "The only regret is not finding CC360 sooner! This is a truly one stop shop for all things digital course, but also emails, social media, calendars, workshops, funnels, you name it - the WORKS! And while I struggle with the tech side often, their customer support is off the charts. No matter what my needs are, there is someone ready willing and able to work through it with me. Hamza even reached out and worked with me to get the best deal for my account and THAT kind of service is hard to find these days. They serve from a genuine place of care and professionalism and I'm so glad I found the best platform to run my business.",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Sharon Johnson",
    "date": "2025-05-08T19:52:08.000Z",
    "stars": 5,
    "title": "I'm an experienced instructional…",
    "text": "I'm an experienced instructional designer and trainer with over 15 years of eLearning design for Fortune 500 clients.After carefully researching multiple eLearning platforms to launch my own eLearning course series, I initially landed on Kajabi as the perfect all-in-one solution.  Until, I discovered Course Creator 360!Stockton has tapped into the pulse of his community by recognizing app stacking is unnecessary and costly, tech support and resources are mandatory and a la cart pricing is antiquated.The 90-day bootcamp is beyond impressive and my onboarding with Tony was thorough and informative.If these 1st impressions are any indication of what's in store, I can't get started building and launching fast enough!",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Sam Hammer",
    "date": "2025-05-08T01:13:45.000Z",
    "stars": 5,
    "title": "These guys care about their customers",
    "text": "These guys care about their customers!  They were willing to work with on a few issues with great communication, and understanding.",
    "avatar": "assets/images/avatars/681be921bf768bd0baf2374a.png"
  },
  {
    "name": "Evie's Artisan Bakery",
    "date": "2025-05-07T22:21:52.000Z",
    "stars": 5,
    "title": "Content Creator 360 is top-notch",
    "text": "Content Creator 360 is top-notch! From the bi-weekly coaching calls, the online training tools, the excellent customer service, and the various done-for-you options, CC360 is WAY more than just another platform! The onboarding call was flawless, my recent communications with Hamza were so helpful, and I cannot praise Stockton enough for his generous knowledge sharing and amazing team! I've used Thinkific, ConvertKit, Kajabi, SamCart, and Flodesk, but offerings at CC360 capture the best of these platforms and SO much more. I was hooked after I saw Stockton's honest review of other platforms on YouTube, and I have not looked back since! Get in while the getting is good!",
    "avatar": "assets/images/avatars/681bc085b83f2cb2877415d2.png"
  },
  {
    "name": "Chris Morgan",
    "date": "2025-05-06T06:34:15.000Z",
    "stars": 5,
    "title": "Ken is the best!!! The support team is the amazing.",
    "text": "The support team is incredible. Ken from the support team, has patiently helped me get thru a bunch of hurdles. There are a lot of challenges getting your business started. Its great to have such patient support.",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Zach Penprase",
    "date": "2025-05-05T01:36:23.000Z",
    "stars": 4,
    "title": "So far I'm having a great experience",
    "text": "So far I'm having a great experience. The live chat is good and pretty well responsive. I am a little confused on how to operate the back office so it's great when i hop on with somebody and they can tell me exactly what to do when I need it done.",
    "avatar": "assets/images/avatars/6817f9f04db5a03bb9e8d69a.png"
  },
  {
    "name": "Kelly Cannizzo",
    "date": "2025-05-04T22:51:45.000Z",
    "stars": 4,
    "title": "So far…loving it!",
    "text": "So far, I’m having a great experience with Course creator 360! Their customer service is unlike anything I’ve ever experienced. Literal 24 hour support and real people there when you need them! I am completely new to course creating and the start of my business. And they are literally helping me with their easy self guided tools and video instructions.",
    "avatar": "assets/images/avatars/6817d359bf768bb9daed630b.png"
  },
  {
    "name": "Kamilla",
    "date": "2025-05-02T20:35:20.000Z",
    "stars": 5,
    "title": "Cc360 has an excellent customer support…",
    "text": "Cc360 has an excellent customer support service and are both quick to reply and helpful and forthcoming with suggestions and solutions to any issues or challenges a customer may be facing. I highly recommend this platform and the amazing people that work within the business. A special thanks to Hamza who was so kind and helpful and incredibly supportive when o got in touch today.",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Milda Kačergiūtė",
    "date": "2025-05-02T19:15:04.000Z",
    "stars": 5,
    "title": "Ray always replies so fast and solves…",
    "text": "Ray always replies so fast and solves all my problems with diligence!",
    "avatar": "assets/images/avatars/6814fd89bf768b1c82eb2643.png"
  },
  {
    "name": "Wayne Hendershot",
    "date": "2025-05-01T23:50:49.000Z",
    "stars": 5,
    "title": "I can't imagine having to run my online…",
    "text": "I can't imagine having to run my online course without course creator 360! Everything I one place is amazing and having their 24/7 online support where I can talk to a live agent anytime I need has been a game changer. Im a customer for life and would recommend them to everyone!",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Colin Jacobs",
    "date": "2025-05-01T22:39:20.000Z",
    "stars": 5,
    "title": "Ray made my experience great today",
    "text": "Ray made my experience great today. It’s important when you can speak with somebody who’s knowledgeable, gets things done, and a pleasure to speak to.",
    "avatar": "assets/images/avatars/6813dbf2bf768be51be9ed6b.png"
  },
  {
    "name": "Kentarian Brown",
    "date": "2025-05-01T13:09:30.000Z",
    "stars": 5,
    "title": "Great service I’m just not a big writer…",
    "text": "Great service I’m just not a big writer but service is next to none",
    "avatar": "assets/images/avatars/608c9046b1791e001c57c5f7.png"
  },
  {
    "name": "Pennie Wilson",
    "date": "2025-04-30T21:43:33.000Z",
    "stars": 4,
    "title": "CC360’s Support is Incredibly Fast",
    "text": "\"CC360’s Support Team is Incredibly Fast and Helpful!\"Having a place where I can ask questions and get quick answers is an invaluable asset as I grow my business. Between the CC360 chat and email support, I usually get a response within minutes. Their fast, reliable support helps me keep momentum and move forward with confidence!",
    "avatar": "assets/images/avatars/68127cc65ad665c8423932b4.png"
  },
  {
    "name": "arielle gruman",
    "date": "2025-04-30T21:36:29.000Z",
    "stars": 5,
    "title": "All of my interactions with Tony and…",
    "text": "All of my interactions with Tony and Ray have been so helpful. They set up my DNS and E-Mail records and always answer so fast and help out with whatever I need. CC360 has been amazing so far!",
    "avatar": "assets/images/avatars/68127bb2b83f2c793f6a88fb.png"
  },
  {
    "name": "C MATH is EASY",
    "date": "2025-04-30T20:46:52.000Z",
    "stars": 5,
    "title": "I saw the ad for CC360",
    "text": "I saw the ad for CC360. I was wanting to restart and rebrand my business. I decided to say yes to the free trial. The onboarding was different than anything I had gone through before. It was hand hold and easy.  ALL the benefits of the program are wow. I am excited to jump in. In conclusion, it was like being at a 5 star hotel having valet parking.",
    "avatar": "assets/images/avatars/681270105ad66575603921b6.png"
  },
  {
    "name": "Kinan AboRich",
    "date": "2025-04-30T16:55:47.000Z",
    "stars": 5,
    "title": "really cool customer service",
    "text": "I've been working with course creator 360 and honestly it has never disappointed me, they have got everything and if i ever felt lost, the customer support are always there to help you with an amazing attitude and step by step guides if needed, my man Salman has helped me multiple times with all my problems and even gave us a really creative and better solution too",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Preston R",
    "date": "2025-04-30T12:21:14.000Z",
    "stars": 5,
    "title": "They give you what they say they will and more.",
    "text": "I don't often write these types of reviews, but the team at CC360 deserves it. They go above and beyond to make things happen and keep me moving on their platform. They always answer my questions and it's ALWAYS super-fast. I've already recommended them to many friends :D",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Brian Vergantino",
    "date": "2025-04-30T00:52:45.000Z",
    "stars": 5,
    "title": "The support team is always patient and…",
    "text": "The support team is always patient and clear in their explanation. They asked the questions in a way that helped me understand what information they need. This is why I use cc360!",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Tipsy Artist",
    "date": "2025-04-29T23:38:10.000Z",
    "stars": 5,
    "title": "⭐️⭐️⭐️⭐️⭐️Course Creator Pro is an absolute game-changer!",
    "text": "⭐️⭐️⭐️⭐️⭐️Course Creator Pro is an absolute game-changer!From start to finish, they hold your hand through the entire process. I was personally helped by Juan Ossa, who went above and beyond to make sure I felt confident and supported every step of the way. What really sets this program apart is the multiple levels of support—24/7 chat (with real humans!), a helpful and encouraging community, email support, and Zoom calls where they literally take over your screen and walk you through the most technical steps.Launching an online course can feel incredibly overwhelming, especially when you’ve looked into other platforms that leave you to figure everything out alone. Course Creator Pro completely eliminated that stress for me. They’ve brought peace, clarity, and confidence to a process that used to feel intimidating—and their video tutorials are gold.If you want your course built the right way with experts who genuinely care, this is the team you want behind you.",
    "avatar": "assets/images/avatars/681146b975d981111a72c248.png"
  },
  {
    "name": "Master Nathan Ray",
    "date": "2025-04-29T21:06:11.000Z",
    "stars": 5,
    "title": "BEST OF THE BEST!",
    "text": "Course Creator 360 is an outstanding program! The clarity of the content is top-notch, and Stockton and his team are phenomenal. What really sets it apart is the immediate and accessible support. Unlike other programs where getting help can be a hassle, Course Creator 360 ensures you get the answers you need right away. This level of expert support has been crucial in helping me complete projects efficiently and grow my business. I highly recommend it to anyone looking to create and sell their courses!",
    "avatar": "assets/images/avatars/66eca066cd007352711d945f.png"
  },
  {
    "name": "Tom",
    "date": "2025-04-29T14:59:11.000Z",
    "stars": 5,
    "title": "Knowledgeable staff",
    "text": "I had some questions about launching my video course. I was totally confused. Nora helped me get to my first steps. She knew exactly how I was feeling and was able to guide me through the frustrating process. She was knowledgeable about CC360 and made me feel at ease.",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Callie Steuer",
    "date": "2025-04-25T23:50:17.000Z",
    "stars": 5,
    "title": "Juan was excellent and helped me set up…",
    "text": "Juan was excellent and helped me set up my sub account quickly and efficiently, and answered all my questions. Great service!!",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Leigh Roberson",
    "date": "2025-04-25T23:42:03.000Z",
    "stars": 5,
    "title": "Victor from Course Creator 360 was…",
    "text": "Victor from Course Creator 360 was extremely helpful. I had watched all the videos they pre recorded for us but was still hung up on something. Victor walked me through with ease and showed compassion and understanding verses rushing me or making sure I had watched all the videos we have access too. I am ADHD and some times need things explained differently and he did just that.",
    "avatar": "assets/images/avatars/680c018b5ad6656e2e32d1e2.png"
  },
  {
    "name": "WTRE",
    "date": "2025-04-25T22:28:16.000Z",
    "stars": 5,
    "title": "Great Customer Service!",
    "text": "Great Customer Service!",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Ryan Dorko",
    "date": "2025-04-25T19:32:17.000Z",
    "stars": 5,
    "title": "This platform is packed with everything…",
    "text": "This platform is packed with everything imagineable for anyone wishing to launch, scale, or create a course. I've also found the support team incredibly responsive and easy to work with when I have questions. This is by far one of the best investments I've made in a long time. Thank you CC360",
    "avatar": "assets/images/avatars/680bc713b83f2cbd8a63e08a.png"
  },
  {
    "name": "Dr. Christopher Kawa, Discover",
    "date": "2025-04-24T22:51:40.000Z",
    "stars": 5,
    "title": "Very Impressed",
    "text": "I just joined a few days ago and am very impressed by what they've built on the Course Creator 360. My onboarding call was with Juan and he did a great job taking me through the process. Excited to continue and get my first course created. Thanks!!!",
    "avatar": "assets/images/avatars/680aa4535ad6650a7e314d01.png"
  },
  {
    "name": "Jill Grindahl",
    "date": "2025-04-24T21:35:43.000Z",
    "stars": 5,
    "title": "Customer Service is A#1 at C360!",
    "text": "Tony was fantastic - very patient and kind. This was my first time going through this process  so I had a lot of questions being so unfamiliar. He brought us through showing us how and then going ahead and setting it up for me since I opted for the Elite plan. He was extremely knowledgeable! When I described how I wanted to start my business and phase into my course, he quickly suggested a coaching template to use to get us started in the right direction. It’s clear that Customer Service is A#1 at Course Creator 360!- Jill G, FounderEmpowHERfulJourney.com",
    "avatar": "assets/images/avatars/680a92874db5a0426edbd838.png"
  },
  {
    "name": "Derek Lovett",
    "date": "2025-04-24T19:16:27.000Z",
    "stars": 5,
    "title": "Great Customer Support!",
    "text": "I have been very impressed by the guidance and support that CC360 provides.  I have had several interactions with their team and each one has been great.  That being said,  I am still new to CC360 and recently I was thinking that I would cancel because it felt like it was a little more than I needed.  However, Hamza helped me through a Zoom call to better understand how to use the CC360 resources.  From that call I was able to clearly see that CC360 was exactly what I needed and I regained confidence in my ability to use it to achieve my business goals.  I appreciate Hamza and the entire CC360 team for their commitment to customer success!",
    "avatar": "assets/images/avatars/6517827b30a6150012016a19.png"
  },
  {
    "name": "Dr. James Crowson",
    "date": "2025-04-24T03:03:10.000Z",
    "stars": 5,
    "title": "Phenomenal Onboarding Experience with Juan",
    "text": "I had my onboarding session with Juan earlier today and was thoroughly impressed. He was professional, knowledgeable, and incredibly efficient—taking what could have been a complicated technical setup and turning it into a smooth, stress-free process. I felt supported the entire time, and it's clear the CC360 team is committed to customer success. The platform itself is exactly what I’ve been looking for—feature-rich, intuitive, and backed by world-class support. Five stars, no question.",
    "avatar": "assets/images/avatars/68098dbce53b6d62522306ac.png"
  },
  {
    "name": "Lynell L.",
    "date": "2025-04-23T22:53:03.000Z",
    "stars": 5,
    "title": "Outstanding Customer Support and Platform",
    "text": "Their customer support is off the charts! Exceptional. And the features are exactly what I WANT and need. Couldn't be happier. After searching for two+ years, and experimenting with two other well known platforms (kartra and kajabi), CC360 is perfect for me.",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Kylee Flores",
    "date": "2025-04-23T19:38:00.000Z",
    "stars": 5,
    "title": "Onboarding with Juan",
    "text": "The onboarding call with Juan was very helpful and released a lot of my stress in regards to domain set-up and all the technical things that I, quite frankly, don't want to do.  I am coming from GoHighLevel where I spent HOURS trying to figure this out and it was so nice to have someone do it for me in less than 20 minutes. 10/10 recommend!",
    "avatar": "assets/images/avatars/680925703e76a4688aaad322.png"
  },
  {
    "name": "David Nardone",
    "date": "2025-04-23T18:53:16.000Z",
    "stars": 5,
    "title": "Best Customer Support Around!",
    "text": "The onboarding call with Juan Ossa for CC360 went smoothly, and he was a great help in getting me all set up and ready to go! This company provides the best support around, and offers a multitude of support videos and tools to learn on your own as well.",
    "avatar": "assets/images/avatars/68091a70bbc6233630092198.png"
  },
  {
    "name": "Max Zoulek",
    "date": "2025-04-23T18:46:03.000Z",
    "stars": 5,
    "title": "I just onboarded and am VERY impressed…",
    "text": "I just onboarded and am VERY impressed with the support, both with tutorials & videos, but also the free onboarding call to set up emails and technical backend that I have no clue about.The whole process thus far ahas been amazing, and the features inside CC360 I have not been able to fin anywhere else under one software sub.How does it get even better?!Thanks guys 💥",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "McKenna Runnells",
    "date": "2025-04-22T19:40:19.000Z",
    "stars": 5,
    "title": "Course Creator 360 has my heart",
    "text": "The onboarding support call was soooo helpful! Juan Ossa the rep I worked with was so great to work with! He answered all my questions and made sure everything was set up correctly. The team set all of the difficult domain stuff for me and it made everything so seamless. I'm so impressed with the course creator 360 experience so far. I feel so supported and excited to keep moving forward.",
    "avatar": "assets/images/avatars/6807d47ce53b6dd46a20e385.png"
  },
  {
    "name": "Jason Cadwell",
    "date": "2025-04-21T23:51:24.000Z",
    "stars": 5,
    "title": "Juan did great for me excited to use…",
    "text": "Juan did great for me excited to use this system",
    "avatar": "assets/images/avatars/6806bdd18f8186a79918914d.png"
  },
  {
    "name": "Lauren Zink",
    "date": "2025-04-20T21:00:30.000Z",
    "stars": 5,
    "title": "So far I am enjoying Course Creator…",
    "text": "So far I am enjoying Course Creator 360. They definitely give you all the tools you need to succeed, and if you ever get stuck, there's a live human to help you. This software is saving me money when you add up the cost of an email marketing software, a website, an e-commerce platform, social media scheduler, landing page software and more. I look forward to getting to know the platform better as I build out my webinar/e-course funnel.",
    "avatar": "assets/images/avatars/663a4e4d15619f296ce6fa32.png"
  },
  {
    "name": "Sue",
    "date": "2025-04-18T21:07:57.000Z",
    "stars": 5,
    "title": "Thanks to Hamza I things are clicking",
    "text": "Thanks to Hamza- things are clicking, he was the most patient person i know.  I know i will succeed with Course CreatorThank you so much",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Daija Hinojosa",
    "date": "2025-04-18T20:51:35.000Z",
    "stars": 5,
    "title": "TOP NOTCH PRODUCT & SERVICE!",
    "text": "Absolutely blown away by the top notch customer service. Not to mention the product itself is a game changer and absolute stress reliever! All of my entrepreneurs know....... Thank you course creator!",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Ching Hsueh",
    "date": "2025-04-18T18:24:06.000Z",
    "stars": 5,
    "title": "Overall",
    "text": "Overall, highly recommend to use it!1. it combined many functions to save your money.2. it has great customer support through chatbot, live chat and a backend team for tech issues.3. the education videos are awesome!Specially thank you to Ray to help find the root cause.",
    "avatar": "assets/images/avatars/67f6972a959ac33c7b271dd2.png"
  },
  {
    "name": "Braden Blacker",
    "date": "2025-04-17T23:41:58.000Z",
    "stars": 5,
    "title": "Very thorough",
    "text": "Very thorough. Was a great help.",
    "avatar": "assets/images/avatars/680175a1959ac300b63310c0.png"
  },
  {
    "name": "Kimberly Taylor",
    "date": "2025-04-17T20:39:05.000Z",
    "stars": 5,
    "title": "I like the customer service I have…",
    "text": "I like the customer service I have received thus far. Juan Asso who managed my onboarding call, was patient and knowledgeable. Every step is guided either on a video or by the instructions. I'm looking forward to launching my course soon.",
    "avatar": "assets/images/avatars/68014abf8f81862f1c14155d.png"
  },
  {
    "name": "Sam K.",
    "date": "2025-04-17T17:04:21.000Z",
    "stars": 5,
    "title": "Word's cannot express how awesome this…",
    "text": "Word's cannot express how awesome this community is! And the support is out of this world. Easily the best support you can find around...Kajabi, ClickFunnels, Teachable, all of them - NOT EVEN IN THE SAME universe as CC360! Facts!I just got finished working with an agent named Nora. She was attentive, super helpful, and actually had a super-cool sense of humor! I hope I get her every time I need help from support!If you're on the fence, jump off, get in, and launch that business you've been dreaming about. This team is committed to your success!",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Lyle Gadin",
    "date": "2025-04-16T16:47:43.000Z",
    "stars": 5,
    "title": "Great experience so far. Awesome service response.",
    "text": "Great experience so far - incredible value. I've been looking for a system to build my course and Course Creator 360 has multiple tools included in their monthly fee making it well worth it.I've also worked with Hamza on the customer service team as I ran into some issues - Hamza was responsive and clear with responses, not to mention they worked with me to overcome some challenges I was having. Thank you CC360 and Hamza!",
    "avatar": "assets/images/avatars/67ffc2eb8f818698d51228d0.png"
  },
  {
    "name": "Jenn",
    "date": "2025-04-15T22:59:23.000Z",
    "stars": 5,
    "title": "Hamza Mushtaq was amazing",
    "text": "Hamza Mushtaq was amazing.  Was patient with all my questions.  Showed me the app and ways that I can utilize it.  Made some templates while we chatted and was next level support!",
    "avatar": "assets/images/avatars/67fec8a5959ac30d902fde51.png"
  },
  {
    "name": "Oscar Nieva",
    "date": "2025-04-15T07:32:38.000Z",
    "stars": 5,
    "title": "It's been an amazing ride",
    "text": "Creating and configuring an Online Course has really been a Big task. I'm quite sure it would have been nearly imposible to do it without the help and support of Course Creator 360 Course information and personal human chat support (thank you Hamza and many others, cheers).Even surviving the nightmare of a near to Black Mirror Experience that is to set up things in Facebook Meta was an accomplishable task after much pain and tears thanks to Course Creator.I would absolutely recommend everyone this service, course and platform. Cheers again Hamza and all of Course Creator 360 staff! 🙏",
    "avatar": "assets/images/avatars/67cb1591bd2f7d03a236222d.png"
  },
  {
    "name": "Zackary DeAngelis",
    "date": "2025-04-14T22:55:05.000Z",
    "stars": 5,
    "title": "It’s the one of the ONLY CRM’s I know…",
    "text": "It’s the one of the ONLY CRM’s I know of that lets you message prospective leads from the same call confirmation SMS phone number. Massive, massive advantage. Huge shout out to to Hamza and the CC360 team!",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Quentin Mezetin",
    "date": "2025-04-14T22:39:23.000Z",
    "stars": 5,
    "title": "Great experience so far",
    "text": "Great experience so far, I really love the customer service I receive. The system does everything!!! I recently had an onboarding with Juan and he went through everything and more with me.",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Ryan Emmons",
    "date": "2025-04-14T22:20:24.000Z",
    "stars": 5,
    "title": "Best decision!!!",
    "text": "I continue to have excellent experiences and couldn’t be happier with the decision to join CC360. Highly recommend!",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Jodi Isaacson",
    "date": "2025-04-14T18:45:19.000Z",
    "stars": 5,
    "title": "if you're a new entrepreneur …",
    "text": "if you're a new entrepreneur feeling overwhelmed by all the tech, Course Creator 360 is your lifeline. I came in knowing next to nothing, and Tony's program is so intuitive, it's practically foolproof. I was able to get up and running in no time. But what really impressed me is the support. Forget endless waiting for replies; they offer live support and even phone calls! It's like having a personal mentor. For a beginner-friendly platform with amazing support, Course Creator 360 gets a 5/5 from me!",
    "avatar": "assets/images/avatars/67fd3b968f81864c370f1bc8.png"
  },
  {
    "name": "Unsatisfied customer",
    "date": "2025-04-13T11:58:44.000Z",
    "stars": 5,
    "title": "Tony was awesome!!",
    "text": "Tony was awesome. Super helpful and informative and took care of things I would have had no idea how to do! I'm really looking forward to the journey ahead with these guys. The chat support has been amazing as well! Super quick response time and very helpful They go above and beyond!I don’t know why it says I’m an “unsatisfied customer” at the top and for some reason I cannot edit it.That couldn’t be farther from the truth!!!",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Daniel Kovacs",
    "date": "2025-04-12T10:23:02.000Z",
    "stars": 5,
    "title": "I run my DaVinci Resolve iPad…",
    "text": "I run my DaVinci Resolve iPad MasterClass with Course Creator 360. It is the best Platform out there for Courses. Also i learned so much from Stockten and Parker. Because of them i quit my job and have now my own Online Business. Thank you so much!",
    "avatar": "assets/images/avatars/64647a5c8fef9f001256517b.png"
  },
  {
    "name": "Lorena Zuluaga",
    "date": "2025-04-12T00:31:00.000Z",
    "stars": 5,
    "title": "Juan is the best",
    "text": "Juan is the best. He was so helpful and patient with all my questions and he spoke Spanish which really supported me since it is my first language. I highly recommend working with him.",
    "avatar": "assets/images/avatars/67f99819fa40065aa0934242.png"
  },
  {
    "name": "Rick Colson",
    "date": "2025-04-11T22:50:29.000Z",
    "stars": 5,
    "title": "Raydabest",
    "text": "Ray, My single point of contact has been nothing less than a super star at assisting Colsonscorner.com into a system that automates what I want in coaching people.",
    "avatar": "assets/images/avatars/5f163f09db50d25c2ecaff9b.png"
  },
  {
    "name": "Angela Marie",
    "date": "2025-04-10T22:27:28.000Z",
    "stars": 5,
    "title": "Good Customer Service",
    "text": "Hamza took care of me during an issue I needed to resolve. I have been with the course creator group for a few months and so far so good.",
    "avatar": "assets/images/avatars/67f829a7959ac3163c291cd0.png"
  },
  {
    "name": "Amber Robinson",
    "date": "2025-04-10T21:58:02.000Z",
    "stars": 5,
    "title": "Phenomenal Customer Service and Attention to Detail!",
    "text": "I worked with Tony for my on-boarding and he was very knowledgeable and patient. He got everything set up within the specified timeframe and showed me all of the training links. I have been teaching in-person for many years so I hope that experience transitions well into video courses! Tony did let me know where to go for help if I ever had any issues or concerns. Overall, the time invested in me by CC360 has been off the charts. I look forward to a rewarding and educative experience using CC360!",
    "avatar": "assets/images/avatars/67f822bda8b3e695dc94ff0c.png"
  },
  {
    "name": "Lindsay Renea Benton",
    "date": "2025-04-10T19:42:48.000Z",
    "stars": 5,
    "title": "Ray was super helpful and detailed",
    "text": "Ray was super helpful and detailed. I had quite a few specific questions and he answered thoroughly. I am realizing this platform has everything I need for my business too!",
    "avatar": "assets/images/avatars/67f803008f818680360a18ce.png"
  },
  {
    "name": "Cate M",
    "date": "2025-04-10T03:08:08.000Z",
    "stars": 5,
    "title": "I am an educator and consultant and I'm…",
    "text": "I am an educator and consultant and I'm over 50. I've taken several classes and spent some real cash in trying to understand the process for creating and selling courses.  In general, most people are ridiculously disorganized thinkers and communicators.  Stockton, on the other hand, is clear and direct. So is his product, and the support is excellent.  I was referred to this from a friend inside a course, and I tried it out alongside Samcart and Kajabi and others.  Nope.  No comparison.  great job.",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Jung Lee",
    "date": "2025-04-08T00:19:52.000Z",
    "stars": 5,
    "title": "I am very happy with this CC360",
    "text": "I am very happy with this Course Creator 360. Stockton is passionate about helping people who want to build their dreams. He is transparent and 100% good person. Juan helped me to connect my domain to CC360. He is very pleasant and answered my questions with care. Thank you so much!  Jung",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Legacy Production House",
    "date": "2025-04-05T03:24:00.000Z",
    "stars": 5,
    "title": "Amazing platform with everything you need!",
    "text": "Amazing platform with everything you need in one place. They continue to find ways to improve the platform and the service from the team is amazing. Super helpful and fast response. CC360 also comes with tutorials to help navigate the platform, streamlines workflows and has live training in the community which is super helpful to increase sales and business knowledge.",
    "avatar": "assets/images/avatars/67f0862389ee145f9056d481.png"
  },
  {
    "name": "Brook Sheehan",
    "date": "2025-04-04T18:31:12.000Z",
    "stars": 5,
    "title": "Not only is this software top notch but…",
    "text": "Not only is this software top notch but the staff and the technical team are incredible. They quickly corrected some backend problems I had and made the process feel so seamless and not confusing. Tony explained things every step of the way. Highly recommend Course Creator 360 to all online business owners looking to create meaningful things in the internet world. :)",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Cindy Lineberger, LCSW",
    "date": "2025-04-02T21:45:48.000Z",
    "stars": 5,
    "title": "After spinning my wheels on Kajabi",
    "text": "After spinning my wheels on Kajabi; I took a change and opted into trial with CC360.  I specifically have found the white glove transfer service(s) extremely helpful.  Tony Sanchez was able to get my domain transferred etc. with professionalism and genuine appreciation of my being a new customer.  Highly recommend.",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "TeJai Clausen",
    "date": "2025-03-31T23:42:58.000Z",
    "stars": 5,
    "title": "The team has been very helpful with…",
    "text": "The team has been very helpful with migration and getting everything set up. They are great at explaining and making sure it’s going to be what is best for your specific business. Highly recommend!",
    "avatar": "assets/images/avatars/67eb0c4e89ee14c493507df8.png"
  },
  {
    "name": "Lisa Cosby",
    "date": "2025-03-31T21:15:48.000Z",
    "stars": 5,
    "title": "I was a bit nervous at first",
    "text": "I was a bit nervous at first, but I had conversations with Hamza, Juan, and several others and have gotten quite comfortable with the process. I am sooo excited to be on the journey with  360 at my side helping me understand everything!!",
    "avatar": "assets/images/avatars/6151f6617c31a200129d32c6.png"
  },
  {
    "name": "Marcel LeBlanc",
    "date": "2025-03-29T19:23:23.000Z",
    "stars": 5,
    "title": "Easy to use software and great value",
    "text": "Easy to use software and great value. Lots of powerful tools designed for course creators.",
    "avatar": "assets/images/avatars/67e82c81b0327a18362f171c.png"
  },
  {
    "name": "Franco Aparicio",
    "date": "2025-03-29T01:46:21.000Z",
    "stars": 5,
    "title": "Ray provided exceptional assistance in…",
    "text": "Ray provided exceptional assistance in creating a new subaccount. His prompt responses and positive demeanor facilitated the process, making it a seamless experience.",
    "avatar": "assets/images/avatars/67e734c4257601f8538f43f0.png"
  },
  {
    "name": "Virginia Smith",
    "date": "2025-03-28T22:53:34.000Z",
    "stars": 5,
    "title": "This experience with CC360 has been…AMAZING",
    "text": "This experience with CC360 has been amazing so far!!! They really make sure you don't feel alone in the set-up process and follow up often to make sure your not feeling lost. The virtual agents Ive worked with are very knowledgeable and patient! Also very excited about the templates they have provided they are simple to edit and implement!!!",
    "avatar": "assets/images/avatars/651eb1929448c70012651b8f.png"
  },
  {
    "name": "Lorraine Daley",
    "date": "2025-03-27T23:03:11.000Z",
    "stars": 5,
    "title": "What an wonderful experience and education",
    "text": "Wow. What an incredible product. So thorough, informative and supportive. They left no stone unturned.  The customer support is incredible and incredibly responsive.",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Coach Susan Cooney",
    "date": "2025-03-27T17:36:48.000Z",
    "stars": 5,
    "title": "Unbelievably outstanding",
    "text": "The customer service with these guys is Unbelievably outstanding. No wait time appointments next day. For someone from the older generation, they are patient understanding and eager to help.",
    "avatar": "assets/images/avatars/67e57089b0327a39db2c448d.png"
  },
  {
    "name": "Scott",
    "date": "2025-03-25T04:40:15.000Z",
    "stars": 5,
    "title": "They are concerned about my business goals.",
    "text": "These folks are concerned about what is important to me and my business, happy to have found them.",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Mark The Ai Screenwriting Guy",
    "date": "2025-03-25T01:09:26.000Z",
    "stars": 5,
    "title": "I just finished building my online…",
    "text": "I just finished building my online course, theaifilmschool.com, and the excitement of finally completing it quickly turned into sheer panic.Where am I going to host this thing? How do I make it easy for students to sign up and take the course? The questions were endless, and the thought of researching and then learning a mountain of different software platforms felt utterly overwhelming.I didn't want to make a career out of juggling 20 different pieces of software – I wanted to share my passion for filmmaking, not become a tech expert!Then I found CC360, and let me tell you, it was a lifesaver. This platform is a true all-in-one solution that solved all my course-hosting headaches.Instead of piecing together a million different tools, CC360 allows me to host my course content directly on their platform, create effective sales funnels, and even manage my clients through their built-in CRM.But that's not all. CC360 also has powerful automation features and email campaign capabilities, allowing me to nurture leads, engage with my students, and streamline my entire online course business.Seriously, this platform does it all! From course delivery to marketing, CC360 has streamlined the process for me, saving me from learning countless other tools.If you're a course creator feeling lost in the sea of tech options, look no further. CC360 is the answer. It's user-friendly, powerful, and gives you everything you need to launch, manage, and grow your online course business in one place. Highly recommended!",
    "avatar": "assets/images/avatars/67e1e6140ee3f6989e8b793c.png"
  },
  {
    "name": "Noreen",
    "date": "2025-03-25T00:18:38.000Z",
    "stars": 5,
    "title": "Ray Salcedo",
    "text": "Ray Salcedo, Customer Success Hero, certainly earned that title again today when he:1) got right back to me about my inquiry and2) fixed my email blockage.I'm thrilled! I love a problem solved.",
    "avatar": "assets/images/avatars/61441529af3bae001249ed13.png"
  },
  {
    "name": "andy patzig",
    "date": "2025-03-21T22:08:27.000Z",
    "stars": 5,
    "title": "Great produced and great people!",
    "text": "I used this software and it was really good. I ended up having to cancel only because right now, unfortunately, I can afford it. Don’t get me wrong, it’s worth the price for all the features but I’m broke. I didn’t cancel in time before the subscription was billed to me. I reached out and said have to say, the customer service was above and beyond. I had an issue I accidentally created and they dug deep, advised me what happened, and handled it like champs. If my coaching business gets rolling, I will come back to this product for sure!",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Derrik Schweppe",
    "date": "2025-03-21T18:14:20.000Z",
    "stars": 5,
    "title": "Saved $7k/month moving from Hubspot!",
    "text": "I've been using Course Creator 360 and the Course Creator Pro course for a couple of years now and I am constantly impressed by the customer service, incredible value, and overall customer experience. They could be charging significantly more for all they offer. We went from paying over $7,000/month to Hubspot to under $300 with CC360 and GAINED tools. It wasn't even a sacrifice to change over. If you're in the fence about working with CC360 I can wholeheartedly tell you that you won't regret it.",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Jim Shields",
    "date": "2025-03-21T00:18:06.000Z",
    "stars": 5,
    "title": "Jake was a HUGE help in the onboarding…",
    "text": "Jake was a HUGE help in the onboarding process. The tools are super intuitive (even at my age).",
    "avatar": "assets/images/avatars/67dc9416aa12986403e9b6e6.png"
  },
  {
    "name": "Jesse Dean",
    "date": "2025-03-20T18:39:18.000Z",
    "stars": 5,
    "title": "The best in the market",
    "text": "Its such a great platform and the service is wicked.",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Ryan Estacio",
    "date": "2025-03-19T22:38:18.000Z",
    "stars": 5,
    "title": "As someone completely new to course…",
    "text": "As someone completely new to course creation, I was nervous about getting started, but this platform made it so much easier. The interface is super user-friendly, and I was able to build my first course without feeling lost. What really stood out, though, was the amazing support every time I had a question, the team was quick to help and super patient. If you're a beginner looking for a simple yet powerful way to create courses, I highly recommend giving it a try!",
    "avatar": "assets/images/avatars/67c0b58422a87753b26679d8.png"
  },
  {
    "name": "Mike Y",
    "date": "2025-03-19T19:57:44.000Z",
    "stars": 5,
    "title": "Hands-down the best support in course creation",
    "text": "CC360 customer support is hands-down the best. Recently, I worked with Nora in an issue where she was super patient and helped me through the situation. She really communicated super well and stepped me through the processes to help me deliver what I needed to accomplish.I am super satisfied with this business as it's going to bring real value to the customers that we serve. Thank you, and I highly recommend this business, Course Creator 360!",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Jodi Jantomaso",
    "date": "2025-03-18T06:03:44.000Z",
    "stars": 5,
    "title": "Just being a beginner with technology",
    "text": "Just being a beginner with technology, Hamza was assigned To be my tech wizard. Not only was he professional, knowledgeable, and patient… He was a great teacher… I learned a lot, and he went one step further directing me to more tutorials so I could learn even further! He assured me that they are there for me & want to see me successful! Thank you, Hamza for all of your encouragement and support… Thank you Course Creator 360 for this platform and opportunity to grow! #Grateful",
    "avatar": "assets/images/avatars/67942d33d4dc7f29726a91fc.png"
  },
  {
    "name": "Kevin S",
    "date": "2025-03-18T00:21:44.000Z",
    "stars": 5,
    "title": "I was having a little issue figuring…",
    "text": "I was having a little issue figuring out how to work some of the website. Your guy took care of it with ease. Surprisingly your rep was super knowledgeable, professional and respectful. Thanks.",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Chamaine Jeffers",
    "date": "2025-03-17T20:32:10.000Z",
    "stars": 5,
    "title": "I'm new to building courses and they…",
    "text": "I'm new to building courses and they made the process very easy and I love the free website they built for me. They also connected my domain for me and there is a 90 minute vide that explains everything step by step. Great experience.",
    "avatar": "assets/images/avatars/67d86a9d5c7a610e10057172.png"
  },
  {
    "name": "Bobby R",
    "date": "2025-03-15T22:57:37.000Z",
    "stars": 5,
    "title": "Great all in one solution for courses and email funnels",
    "text": "Great software and all in one solution for anyone looking to create a course. Hopped on a zoom call and they walked me thought the process of getting everything set up with my domain and it really easy. Highly recommend!",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Sandra Pacheco",
    "date": "2025-03-15T15:59:32.000Z",
    "stars": 5,
    "title": "Nora is the best",
    "text": "Nora is the best! she fix a problem that I had with a funnel in seconds, I love the customer service!",
    "avatar": "assets/images/avatars/67a2869d8b57c4ae6ec8fea7.png"
  },
  {
    "name": "Tiffany Perez Ferrando",
    "date": "2025-03-14T21:02:55.000Z",
    "stars": 5,
    "title": "Great fast response and solution!",
    "text": "Great fast response and solution!",
    "avatar": "assets/images/avatars/67d47d537062e8f4ebd31bb5.png"
  },
  {
    "name": "Erin Tamberella",
    "date": "2025-03-13T16:21:50.000Z",
    "stars": 5,
    "title": "This Is Why I Chose CC 360",
    "text": "I was trying to get my first course in and ready to present to a large corporation's training department the next day. I was borderline freaking out until I hooked up with Nora in the support chat. She was amazing and went through every single one of my questions, made a series of loom videos for me, emailed me a transcript. I couldn't have asked for any better service and I feel confident going into tomorrow's big meeting thanks to Nora. Support was one of the main reasons I went with CC 360 and Nora proved today I made the right decision!",
    "avatar": "assets/images/avatars/67d2e9f37062e86275d13a0f.png"
  },
  {
    "name": "Your Super Life",
    "date": "2025-03-14T04:40:18.000Z",
    "stars": 5,
    "title": "Kindness & confidence",
    "text": "Kindness & confidence. I was confident that Jake knew his tech details and was able to take care of things that needed to be done. Much appreciation!Stockton the Founder of CC360 is an amazing, inspiring, uplifting young man, and his video trainings and courses are well done and to the point! I'm super excited to move forward with this organization!",
    "avatar": "assets/images/avatars/5e77ca834c154f2fc93107b5.png"
  },
  {
    "name": "Cam Ellsworth",
    "date": "2025-03-12T03:34:46.000Z",
    "stars": 5,
    "title": "The customer support is second to none",
    "text": "The customer support is second to none!   Tony got me squared away in no time.",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Tammy Magnuson",
    "date": "2025-03-11T14:13:44.000Z",
    "stars": 5,
    "title": "Excellent customer service and the…",
    "text": "Excellent customer service and the super fastest response times.No more waiting to figure out how to create your masterpiece!  You'll get help with the touch of a help icon.Love that!!And NORA will brighten your day with her vibrant hilarious energy!",
    "avatar": "assets/images/avatars/63e521f1e0ac6c0013e5e0ac.png"
  },
  {
    "name": "Gina M Gonzalez",
    "date": "2025-03-08T20:11:19.000Z",
    "stars": 5,
    "title": "The customer service is out of this world amazing…",
    "text": "The customer service is out of this world amazing!  I can't praise it highly enough. Does not matter what issue I \"chat-in\" on, they have a fast solution, either with explanation or if more complex, with a loom. Awesome stuff! Nora just walked me through 3 issues, one of which was so silly, I should have figured it out on my own. She never made me feel dopey, either. Keep up the awesome work guys/gals!",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Mark Power Power Stuttering Th",
    "date": "2025-03-07T21:55:24.000Z",
    "stars": 5,
    "title": "Just starting and impressed already",
    "text": "My experience with coursecreator.com has blown me away so far. I’m just setting up and was very happy and relieved that they set up all my domain integrations as part of the plan for free. I am impressed by this company!",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Joie Rhein",
    "date": "2025-03-07T21:14:04.000Z",
    "stars": 5,
    "title": "Top notch support",
    "text": "The platform is amazing but the thing that sets CC360 apart from any other platform is the support and hand holding they provide.",
    "avatar": "assets/images/avatars/67cb4571bd2f7da22536695f.png"
  },
  {
    "name": "Eddy Rosell",
    "date": "2025-03-07T18:01:18.000Z",
    "stars": 5,
    "title": "I have had a wonderful experience with onboarding with Juan",
    "text": "I have had a wonderful experience with CC360. The attention to detail and the onboarding experience made getting started really easy and quick. Highly recommend.",
    "avatar": "assets/images/avatars/67cb18461c0352955a0014bc.png"
  },
  {
    "name": "Nathan Adam",
    "date": "2025-03-07T16:30:21.000Z",
    "stars": 5,
    "title": "Nora was professional",
    "text": "Nora was professional, super fast and resolved my domain challenge with a Loom video in less time than it took me to type out my question. Thank you!",
    "avatar": "assets/images/avatars/67cb02e49a702678c49df1e9.png"
  },
  {
    "name": "Happy customer",
    "date": "2025-03-07T15:06:53.000Z",
    "stars": 5,
    "title": "Great staff!!",
    "text": "First of all, I don’t leave reviews. The customer service at CC360 is 100% amazing though. Everyone I have talked to is super helpful and energetic. I have to especially thank Nora, who made my whole day with her positive energy. My gf thinks I have a crush on her…and I might. 😂",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Hugh",
    "date": "2025-03-06T01:32:19.000Z",
    "stars": 5,
    "title": "So excited to be working with cc360 as…",
    "text": "So excited to be working with cc360 as a person who is not technology driven Rays support was incredible. The all in one package is incredible !!",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Ash Johnson",
    "date": "2025-03-06T00:24:10.000Z",
    "stars": 5,
    "title": "I Love this software so much",
    "text": "I Love this software so much. There have been multiple times where I've thought of something that would be a convenient automation for my business. Every time so far, CC360 has already had the solution. If you're a small business, you owe it to yourself to get this software!",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Devid di Expanda.it",
    "date": "2025-03-05T23:14:31.000Z",
    "stars": 5,
    "title": "⭐⭐⭐⭐⭐",
    "text": "CC360: ⭐⭐⭐⭐⭐CC360 is an exceptional platform, packed with powerful tools that make content management easier and more efficient. But what truly sets it apart is the incredible support.The team is not only super responsive and available, but they also guide you step by step in using all the features, ensuring that you can fully leverage every tool—at a level of personalized support unmatched by other platforms that cost much more.If you’re looking for a comprehensive platform with outstanding support, CC360 is the right choice! 🚀🔥",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Adriene Conner",
    "date": "2025-03-05T00:32:26.000Z",
    "stars": 5,
    "title": "I am a course creator with this great company. They're the best I've experienced.",
    "text": "I am a course creator with this great company. The feedback that they provide is second to none. I love the multiple ways they provide help to help their creators.  It doesn't matter what time of the day it is, they are always at your service! And that's top-notch support to me! Thank you CC360! YOU ROCK!",
    "avatar": "assets/images/avatars/67c77f64d777aa273e45f788.png"
  },
  {
    "name": "Mathis Kennington",
    "date": "2025-03-04T20:52:08.000Z",
    "stars": 5,
    "title": "Worked thru some technical problems…",
    "text": "Worked thru some technical problems well and got me all set up. Appreciate the patience.",
    "avatar": "assets/images/avatars/67c74bcfd2f1b47f8dd937c7.png"
  },
  {
    "name": "Sheldon D'Eith",
    "date": "2025-03-04T01:12:07.000Z",
    "stars": 5,
    "title": "Fantastic Platform for Educators!",
    "text": "Im having a great experience with CC360. Theres always someone to help with any issues I might have, the layout it easy to follow and the courses gave me everything I need to get started. The templates are very helpful as well! And I've only just scratched the surface! Thank you!",
    "avatar": "assets/images/avatars/67c6373fd2f1b45f8fd7fc08.png"
  },
  {
    "name": "Bill Myers",
    "date": "2025-03-03T23:00:35.000Z",
    "stars": 5,
    "title": "It was great working through the on-boarding process",
    "text": "It was great working through the on-boarding experience with Tony from Course Creator 360.  He was patient and very accommodating in answering questions I had and walking me through the setup process.",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Richard",
    "date": "2025-03-03T12:44:47.000Z",
    "stars": 5,
    "title": "Omer is brilliant",
    "text": "Omer is brilliant! Well done.",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Hugh Hornsby",
    "date": "2025-02-28T19:15:18.000Z",
    "stars": 5,
    "title": "Wow, this is the help I needed.",
    "text": "Was actually what I needed. Needed the support that CC360 gave so I could host and begin uploading my courses. Juan was patient and helped me understand and really get started",
    "avatar": "assets/images/avatars/67c1ef16db25a49a008d05b8.png"
  },
  {
    "name": "Jennnifer Dearman",
    "date": "2025-02-28T05:38:12.000Z",
    "stars": 5,
    "title": "The customer service has been KEY to…business operations",
    "text": "The customer service has been KEY to all of this.  My staff and I are not \"techies\", but we also realize how much we require the all encompassing services to operate in the leanest way possible, and meet budget constraints as well.With JUST the $97 price point subscription, we can have all of the services we require: community, course creation primarily but SO much more that will aid us in marketing them with the unlimited: email, funnels, domain hookup, marketing campaigns to name a few.The BEST part has been the Onboarding with Juan (who was SO patient in troubleshooting my device complications) and then a chat online with Jay who was also helpful to confirm our payment info  was updated for our email domain purchase.We were considering another platform, but we were SOLD once we did the demo (and I forgot his name...but he was amazing as well).I am not impressed easily, but C360 rightfully earned our business to run our business.",
    "avatar": "assets/images/avatars/67c12f999d678a368f3fab0e.png"
  },
  {
    "name": "Renee Spencer",
    "date": "2025-02-27T21:16:59.000Z",
    "stars": 5,
    "title": "I am beyond grateful for Course Creator…",
    "text": "I am beyond grateful for Course Creator 360 and Course Creator Pro! This course has been a game-changer in helping me bring my Master Body Sculpting course with eBook to life. As someone who is not an expert (or even a beginner!) when it comes to social media or tech, I can honestly say that this platform makes everything so much easier. It lays everything out for you in one place and guides you step by step.Customer service is top-notch – they're available 24/7, and yes, you can actually speak to real humans! Special shoutout to Nora, one of the best customer service reps. She’s been incredibly patient with me, and I’m sure she probably cringes every time my name pops up, but she never lets on. Nora always stays connected to ensure I’ve been properly assisted and even provides helpful recommendations. I can’t thank her enough for all her support.Thank you again, Nora! I'm sure I'll be reaching out again soon!",
    "avatar": "assets/images/avatars/6484ce62818bf50011ca6988.png"
  },
  {
    "name": "Carol Cavedagne",
    "date": "2025-02-27T19:52:34.000Z",
    "stars": 5,
    "title": "Awesome tool and and even more awesome customer service team! Nora is the best!",
    "text": "I've been really happy with CC360 so far, we haven't launched our course yet but it really does it all and it is easy to use! But what I've been most impressed with is their customer service. They are always there for you (literally always on chat, replying within seconds) and will help you in the best way possible! The agent who has helped me the most is Nora and she is the best! She's such a huge help and great at her job, thanks for everything Nora!!!",
    "avatar": "assets/images/avatars/67c0a65a8d25fbeae591a456.png"
  },
  {
    "name": "Alan Houghtaling",
    "date": "2025-02-27T19:33:08.000Z",
    "stars": 5,
    "title": "The support is incredible",
    "text": "I am in the trial phase of Course Creator 360 at the moment and am honestly still deciding whether to commit fully. I will say that there is a learning curve for sure in getting up to speed, and the software is pretty robust. I wish there were more customizable templates for courses, but that is a small critique.What has really stood out thus far is the customer support. I have used it almost daily, and the help has been stellar. While I have chatted with a few folks, Nora in particular has been a life saver. She is always patient and incredibly informative. This is key, especially with someone new to the platform. I said this to her, and I will write it here. If I do fully commit to coming on board, it will have a good deal to do with the support she has offered over the past couple of weeks. When it comes to platforms like this, I really think they are only as good as the support you receive, and by that measure this platform should absolutely be tried out!",
    "avatar": "assets/images/avatars/67c0a1c922a877b62c665b23.png"
  },
  {
    "name": "Rmb",
    "date": "2025-02-27T18:57:23.000Z",
    "stars": 5,
    "title": "Best all in one platform",
    "text": "Best all in one platform.  That replaces a half dozen or more softwares and applications.  Saves money and most importantly makes it more efficient to do you work.  We had used Kajabi, Click Funnels, Infusionsoft then Keap, schedule once, word press sites, zapier...and more.",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Kathy Roberts",
    "date": "2025-02-27T17:03:15.000Z",
    "stars": 5,
    "title": "Unbelievable Support!",
    "text": "Just having the support 24/7 is incredible. Having someone to touch base with when you're stuck is something that can't be measured. When I had problems before I was held captive by tech people and at their mercy. With CC360 I get the help WHEN I need it. Nora knows what's going on with me and my business and I love that when she shows up I'm relieved. Camil s also amazing! I know that I'll have the help I need without any confusion. They're all great, just wanted to give a special shout out to those 2 rock-stars!",
    "avatar": "assets/images/avatars/635038d9eaf816001282184d.png"
  },
  {
    "name": "Art",
    "date": "2025-02-27T01:03:36.000Z",
    "stars": 5,
    "title": "Juan Ossa was fantastic in helping me…",
    "text": "Juan Ossa was fantastic in helping me through the onboarding process and all associated questions that I had.",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Dayna Marie",
    "date": "2025-02-26T19:51:49.000Z",
    "stars": 5,
    "title": "What made my experience great was a few…",
    "text": "What made my experience great was a few things: 1)  Ease of sign up 2) Great support 3) Simple integration process 4) Short, very short time to fully implement.",
    "avatar": "assets/images/avatars/67bf54ab98acc7176206ce9c.png"
  },
  {
    "name": "Vera Kasevich",
    "date": "2025-02-25T05:43:53.000Z",
    "stars": 5,
    "title": "Super Quick Migration from KAJABI! Wow!",
    "text": "I did my first review just a week ago, but really want to share this for anyone who's still hesitating!My website and 100+ video course were migrated from KAJABI in record time! I was expecting it to take a week or two, but it was done in just four days!Now, I’m diving into the CC360 platform, exploring all my options, and getting surprised daily by the powerful features included in the subscription. I easily added a few new domains, built and connected multiple websites, and now I have two accounts to run two businesses—while only paying for one subscription! This platform is exceeding my expectations, and I can’t wait to see what else it can do!",
    "avatar": "assets/images/avatars/67aaa24d58a0a9c8a8cd92ec.png"
  },
  {
    "name": "Troy Sandford",
    "date": "2025-02-24T14:18:00.000Z",
    "stars": 5,
    "title": "I just made $10,000 USD in the last week…",
    "text": "I just made 10k USD in the last week—more than I’ve ever made in a week before!”I hit 10k in sales already, with no effort. THANKS TO COURSE CREATOR 360. Stockton, you’re the man. I’m at your service for life. No one will ever be able to repay you for what you’ve done for your students.Your system of teaching—the clarity, dedication, and personal attention—is worth 10x what I paid. To be mathematically correct, I’ve made back in one week of using my card 227 times the amount in USD that I invested for one week of the CCP360 cost. When you look at those numbers, it’s just unbelievable.Haha, I’m laughing as I type this. It’s crazy how I was living before. I ran a notable team in China, trained and developed some of the brightest careers in the acting and action world there, and opened my own studio. I put all my life savings into it and went into debt when COVID hit and business dropped. Many of my friends and team members betrayed me when things got tough.Life wasn’t looking as good as it should’ve been. But you gave me a way out of a depressing black hole of debt and failure. Life isn’t always fair, but you gave me the tools and ammunition to take my business back to where it belongs—at the forefront. I had many strategies to fix my poor fortune, but when I learned of Stockton and Course Creator 360, I watched his content and saw something in him that reminded me of my martial arts master who changed my life.I saw the truth, and I chose to follow that light, just like a ship follows a lighthouse—guided by his expertise, his care, his attention, and his zero tolerance for time-wasting BS. Stockton taught me how to make more money faster than I ever could directing a feature film.I’ve shot commercials for Toyota, DJI, and worked on some of the highest-grossing films of all time. But I’ve never made money faster or as honestly as I have when my students click the “enroll now” button—a button that exists only because Stockton doesn’t quit.He possesses what I teach my students—‘Limitless mental courage.’I’ve been waiting my whole life to find a teacher and mentor like you, Stockton. The honor is mine, sir. For the rest of my days, wherever I am, whatever I may be doing, I stand a little different now, and I do so with some of you in my stance.God bless you. It’s not even about the money. I don’t give a shit about the money. I chose to follow you because I chose to believe in you. All I care about is working with good men, strong men, honest men.To me, you are worth more money than I could ever make from learning from you, sir.It’s been a privilege and an honour. I will work my ASS off to make you proud.To whom it may concern, here this and hear it loud:All I did was listen to Stockton and follow his course on how to create a course called 'Course Creator Pro'. I did exactly as he teaches. I took all the knowledge I’d given my team members for FREE for years while making TONNES of money for them—and turned it into a course.Now it’s selling at 997 USD, and the people who’ve paid the full price are telling me I’m stupid because it’s worth over 5k-8k USD. They say I need to raise the price… I nearly gave it away for 300 USD.To validate the efficacy of this Trustpilot review, you can find my course at troysteamonline, powered by Course Creator 360—the best and most affordable online course software available.The year is 2025. From this point on, my life will never be the same.Stand by to get some.God bless Stockton and his excellent team under Course Creator 360.",
    "avatar": "assets/images/avatars/6789f7bd87f0262eaaf1ff67.png"
  },
  {
    "name": "Jason Gibson",
    "date": "2025-02-23T16:10:49.000Z",
    "stars": 5,
    "title": "Support is better than anywhere else",
    "text": "Software works. When it doesn't, support is there. Having worked with multiple applications through the years, I have to say one aspect that stands out with CC360 is each person you work with doesn't make you feel dumb...even when the mistake is a picnic problem (Person In Chair, Not in Computer).",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Amy Porter",
    "date": "2025-02-22T15:00:53.000Z",
    "stars": 5,
    "title": "Service is everything to me",
    "text": "Service is everything to me. The experience of someone taking the time to listen about my business \"galaxy\" and understand how to help is priceless. Hamzah is that someone who is happy to help. The energy in his voice highlights his passion for the company and I enjoy working with them very much for this reason. I look forward to the growth opportunity for my startup with the myriad of options, all in one place.",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Steven Johnson",
    "date": "2025-02-22T03:53:32.000Z",
    "stars": 5,
    "title": "Super well laid out videos for all the…",
    "text": "Super well laid out videos for all the complexities of getting this process going. No doubt that its a huge learning curve but the training is very helpful and step by step and when you get stuck you've got a dedicated team of trained individuals who really provide professional and kind support.",
    "avatar": "assets/images/avatars/67b92e131956405918fa4ee4.png"
  },
  {
    "name": "Paolo Narciso",
    "date": "2025-02-21T17:55:50.000Z",
    "stars": 5,
    "title": "Excellent onboarding session with Juan.",
    "text": "Excellent onboarding session with Juan.",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Johnny Walker",
    "date": "2025-02-21T01:47:53.000Z",
    "stars": 5,
    "title": "Automation is KING",
    "text": "Stockton and the team have helped me streamline and GUIDE my business to MORE success! I couldn't believe how many integrations are included!The team is VERY responsive and I couldn't be happier with all of the support.I'm a fanboy.",
    "avatar": "assets/images/avatars/67b7befa50283bc1e4199e16.png"
  },
  {
    "name": "Daniel Emerson",
    "date": "2025-02-20T20:18:55.000Z",
    "stars": 5,
    "title": "WORTH EVERY SINGLE PENNY PLUS SOME.",
    "text": "WORTH EVERY SINGLE PENNY PLUS SOME..I've tested software for the last 10 years. I am not a novice in building and creating revenue online. However what they do is exceptional work because they do give you everything in frameworks, and templates. Just buy it... if you're reading this and ready to actual level up business and marketing results. Just buy it.",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Alexis Flores",
    "date": "2025-02-20T19:53:28.000Z",
    "stars": 5,
    "title": "The software is a great tool for anyone…",
    "text": "The software is a great tool for anyone creating a course.",
    "avatar": "assets/images/avatars/67b76c02d7c729400f2191a0.png"
  },
  {
    "name": "Katherine Hall",
    "date": "2025-02-20T19:38:18.000Z",
    "stars": 5,
    "title": "Great Service and Products",
    "text": "Great Service and Products! The team also responded to my concerns quickly.",
    "avatar": "assets/images/avatars/67b76884d7c7297cfa218c96.png"
  },
  {
    "name": "Tymothy Roy",
    "date": "2025-02-19T19:04:10.000Z",
    "stars": 5,
    "title": "Simply the best",
    "text": "The customer support of CC360 is simply unparalleled, not to mention the software itself being able to accomplish 99% of what I need.I simply couldn't understand anybody wanting to use something else after being exposed to it.Yup, big learning curve, but back to my original comment about customer support... fast, efficient, and thorough.",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Alex P",
    "date": "2025-02-19T14:47:37.000Z",
    "stars": 5,
    "title": "You should switch to CC360",
    "text": "I've been having issues setting up notifications for my company. The issues occur because I was subscribed to lots of different types of software and things were complex. I am almost finished with the process of moving everything over to CC360, and it makes life easier. A lot easier. I'm utilizing the WhatsApp integration so my users get important notifications now. Great software.",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Tetsuo Hatanaka",
    "date": "2025-02-19T12:00:32.000Z",
    "stars": 5,
    "title": "Overwhelming Tech to INSTANT Support",
    "text": "Man you think all this tech stuff and course creating is so overwhelming and it TRULY IS.Its a huuuuuuuugeeee learning curve let me tell you.the best thing about Course Creator 360 is the FAST customer agent supportgoing to chat, getting live feedback analysis, answers within minutes is unparrallel.no email exchange, no waiting, no FAQ BSthats what makes this program so different, is theres always a support staff that answers exactly what youre looking for with a loom videoso no matter how small, how detalied, how specific the question is a product expert is able to explain this within minutes.So you always feel like youre saved.Hot damn.",
    "avatar": "assets/images/avatars/6419d9e2f46044001264a9ff.png"
  },
  {
    "name": "Jacob Atisha",
    "date": "2025-02-19T05:14:17.000Z",
    "stars": 5,
    "title": "I had an incredible experience",
    "text": "I had an incredible experience with this company. What they offer is truly revolutionary, making everything simple to navigate and easy to use. Their platform is well-designed, and their team is incredibly personable—they genuinely want to help you succeed. You can tell they put a lot of effort into ensuring their users have the tools and support they need to grow.Unfortunately, the timing just wasn’t right for me. I wasn’t quite ready to take full advantage of everything they offer, so I had to step away for now. But if you’re at a point where you’re ready to launch and scale a product, I highly recommend checking them out. Their resources and support are top-tier, and I can see how they would be a game-changer for the right person. I hope to come back in the future when I’m truly ready to make the most of it!",
    "avatar": "assets/images/avatars/67b54c7350283b49451684e4.png"
  },
  {
    "name": "Kim Magloire",
    "date": "2025-02-15T19:28:41.000Z",
    "stars": 5,
    "title": "Great Onboarding Experience with CourseCreator360",
    "text": "I'm launching a new business and need a website that integrates downloadable products, calendar bookings, CRM, automated reminders and webinars. The on-boarding process with Tony was done in 1 hour which was amazing given the number of pieces to integrate.",
    "avatar": "assets/images/avatars/64dfe2d6f6b4d000114268eb.png"
  },
  {
    "name": "Usama Anjum",
    "date": "2025-02-14T22:33:28.000Z",
    "stars": 5,
    "title": "Amazing Customer Support!",
    "text": "Amazing Customer Support!The platform is great if you want to get all your assets in one place! What makes it truly amazing is the solid customer support. Hamza in particular is super helpful and always provides great solutions whenever I get stuck! Highly recommended!",
    "avatar": "assets/images/avatars/67afa891d7c729c3991993e2.png"
  },
  {
    "name": "Mike Graff",
    "date": "2025-02-13T18:57:58.000Z",
    "stars": 5,
    "title": "Super helpful",
    "text": "Super helpful, making the complex pieces of running an online-course business much more doable and smooth.  Grateful they exist!",
    "avatar": "assets/images/avatars/67ae2483616ded51bd3cc474.png"
  },
  {
    "name": "Kristen",
    "date": "2025-02-12T20:03:03.000Z",
    "stars": 5,
    "title": "The customer support has been awesome",
    "text": "The customer support has been awesome.  The chat is helpful, and the live agents really go above and beyond to help you get everything you need up and running.  Hamza has been wonderful!",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Stefani Koodrin",
    "date": "2025-02-12T17:44:49.000Z",
    "stars": 5,
    "title": "The customer support on this platform…",
    "text": "The customer support on this platform is UNREAL. I’m not very tech-savvy, so I was getting frustrated and ended up canceling my subscription. But then, THEY reached out to me, asking why I canceled. I explained, and they listened—literally taking all the stress off my shoulders. They built my webpage, walked me through setting up my business and automation, and now handle all the things I struggle with. It’s like having a personal assistant! Plus, the 24/7 support, especially during those late-night work hours, is a game-changer. Hamza, who works with the platform, is amazing—whenever I run into issues, he reaches out to make sure everything’s running smoothly and I’m getting my money’s worth. I highly recommend this platform if you’re looking for an all-in-one solution for your business. The customer support is the best you could ask for!",
    "avatar": "assets/images/avatars/67acc1e9cc770d2acf4fc33c.png"
  },
  {
    "name": "Rebecca Troup",
    "date": "2025-02-12T02:25:46.000Z",
    "stars": 5,
    "title": "Wow, CC360 has it all!",
    "text": "Wow! CC360 has it all! Video tutorials, templates, funnels, support that is over the top!, bi-weekly Zoom calls, online community, the list goes on. If you are on the fence, go for it. Every time I feel overwhelmed by the course creation process, their Chat reps save the day!",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Sean",
    "date": "2025-02-11T19:56:16.000Z",
    "stars": 5,
    "title": "10/10 would recommend",
    "text": "I’ve tried a lot of services like this and have been VERY impressed with CC360Incredible product with outstanding support (which is rare in my experience)Keep it up, CC360, y’all rock",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Zac McCulloch",
    "date": "2025-02-10T20:40:17.000Z",
    "stars": 5,
    "title": "Great service",
    "text": "Great service. Kevin is a legend.",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "BrendanRogers",
    "date": "2025-02-10T09:09:54.000Z",
    "stars": 5,
    "title": "BY FAR the best product!",
    "text": "Product is excellent. The 24/7 support is fantastic. The coaching and training calls are high value and then the templates provides means you can make things happen quickly. This is BY FAR the best product in the online course creator space!",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Cole Netten",
    "date": "2025-02-09T05:55:49.000Z",
    "stars": 5,
    "title": "Course Creator 360 is the Real Deal",
    "text": "Course Creator 360 is where it’s at. These guys are truly here to help you win—no extra add-ons, no upsells, just a solid all-in-one platform that makes everything simple.Everything you need to succeed is in one spot—no need to mess around with multiple software integrations or expensive third-party tools. It’s all built-in, and they’re constantly adding new features to make it even better.And their customer support is next-level. Super responsive, helpful, and actually invested in your success. Whether you're just getting started or already running a course business, they’ve got you covered.Highly recommend!",
    "avatar": "assets/images/avatars/67a8273c58a0a95a5ecbe338.png"
  },
  {
    "name": "Renee Neal",
    "date": "2025-02-05T18:26:28.000Z",
    "stars": 5,
    "title": "Friendly and insightful",
    "text": "Friendly, patient and extremely helpful.",
    "avatar": "assets/images/avatars/67a391207bf75698f12a19ed.png"
  },
  {
    "name": "Greg Laskody",
    "date": "2025-02-05T00:38:04.000Z",
    "stars": 5,
    "title": "GET COURSE CREATOR 360 RIGHT NOW!",
    "text": "After spending a solid two years doing nothing but tire-kicking countless content and community management platforms, I was sold within the first 5 minutes of my initial demo from Course Creator 360.  To say that CC360 is the most powerful platform on the planet would be an understatement.  The CC360 platform has EVERYTHING I need, all under one roof, and without the need to cobble together a framework from \"zaps-n-apps\" that constantly break and don't work.But wait .... there's more!The only thing better than the CC360 platform is the entire CC360 customer support team.  From the best of cutting-edge AI technology that's immediately available 24/7, to the best hands-on technicians, I've always received dedicated support within three minutes.Further, the amazing culture that Stockton Walbeck has infused into this team is as contagious as it is rewarding.  These guys n gals know exactly what they're doing, and how to fix everything.So if you want the perfect, all-around platform from which to host your course, product, or community - stop torturing yourself and sign up with CC360, I promise that you will not regret it!",
    "avatar": "assets/images/avatars/67658e80e18939277f8be1b4.png"
  },
  {
    "name": "CloseWithJoe Solutions ltd.",
    "date": "2025-02-04T19:03:49.000Z",
    "stars": 5,
    "title": "Best Support on the market",
    "text": "This entire process is seamless and worry free, exactly how it should be! Stockton and his team are an absolute pleasure to work with, as a new user, this digital space has never been easier to navigate.I highly recommend this platform to any course creator!",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "JR",
    "date": "2025-02-04T03:08:44.000Z",
    "stars": 5,
    "title": "Phenomenal Customer Service",
    "text": "I am a total beginner with Course Creator and I have to say that so far the software is everything I hoped for and more.  It is truly all-in-one and has more features than any of the other platforms I have used.  All of it being on one dashboard it so nice. No more jumping from tab to tab to chat, schedule, automate - it is all in one place.I have to say THE CUSTOMER SUPPORT IS PHENOMENAL. 24/7, super fast and responsive.  Any question I had, they answered and resolved in minutes. Truly a pleasure to deal with. I would give them 10 stars if it were possible!",
    "avatar": "assets/images/avatars/5976804c0000ff000ab32ea7.png"
  },
  {
    "name": "Pepijn T",
    "date": "2025-02-03T23:48:59.000Z",
    "stars": 5,
    "title": "Best course hosting platform on the…",
    "text": "Best course hosting platform on the planet. Combination of in-depth explanation of HOW to run a course + a software that lets you basically do anything and everything you need to run a successful course.Really great customer service if needed.Basically anything is possible and personal communication.Would recommend.",
    "avatar": "assets/images/avatars/67a139bf07249d29dec2de86.png"
  },
  {
    "name": "April Pettengill",
    "date": "2025-02-02T05:46:37.000Z",
    "stars": 5,
    "title": "You guys are super on top of things…",
    "text": "You guys are super on top of things making sure there’s no questions or I don’t have any issues. Did great on my course . Today with all the AI a lot of times you feel like you’re dealing with Ai but these guys you don’t I actually feel like I am dealing with real people. I like that they are super helpful!",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Darrell Ross",
    "date": "2025-02-01T00:55:51.000Z",
    "stars": 5,
    "title": "Real genuine customer service",
    "text": "I had a couple of challenges and reached out to cc360 customer service.  They were very timely in their responses and helped solve my issue 100%.I believe that they truly value their customers and have systems in place to demonstrate this.",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "The Way of Yin",
    "date": "2025-01-30T21:57:36.000Z",
    "stars": 5,
    "title": "Since I signed up for the 30-day free…",
    "text": "Since I signed up for the 30-day free trial, I've gotten so much engagement and offers of support from your team. To be honest it was a bit overwhelming at first, but I think I'm realizing the complete lack of support from other platforms, and I somehow just got used to it. It's as if you really want us to succeed. I'm really excited to dive into all of the resources to get everything running. It's such a relief to know that it's all in one place with such an attentive support system. Thank you so much.",
    "avatar": "assets/images/avatars/679bd99c983803f96d99f0db.png"
  },
  {
    "name": "Bryan Clark",
    "date": "2025-01-28T22:10:19.000Z",
    "stars": 5,
    "title": "great customer service and getting to…",
    "text": "great customer service and getting to speak to a real human being is priceless these days!",
    "avatar": "assets/images/avatars/6799399c3b94f58fbc230ef3.png"
  },
  {
    "name": "abdaren",
    "date": "2025-01-28T16:35:38.000Z",
    "stars": 5,
    "title": "Amazing Experience.",
    "text": "It is such a fantastic, caring, excellent company. As someone new to this business of online courses with a LOT to offer but crippled with fear and looking for a reason to RUN and abandon for fear of failure and starting, having this platform and the team behind it has given me an excuse to push through. To birth this God-given vision. so thank you, Stockton and team, because you are helping birth destinies. It takes something as simple as a bad experience or no support to kill a vision completely. You've all so far made this journey easier than expected, with your support and kindness. Thank you.",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Sheria Butler",
    "date": "2025-01-27T21:09:32.000Z",
    "stars": 5,
    "title": "I'm very impressed so far...",
    "text": "I have seen a few advertisements for Course Creator 360 and I admit that I was hesitant to try it. I needed a place for my courses and I have used Thinkific, Learnworlds and Kajabi. I wasn't sure that CC360 could deliver on all they promised at an affordable price. I get so many sales offers and invitations to demo software as a business owner that I am rarely impressed anymore. Well CC360 changed that!! As soon as I opened the software and looked around, I couldn't believe everything that I needed was in one place. I always had to piece together multiple types of software to manage my business. No more!! I jumped on the demo with Jack, who was super nice and helpful. He listened to my concerns and showed me that they even have training, support, website building and landing page building done for you, templates, funnels and more!! Although I'm new to this company, I'm excited to see where my business can go using this software!!!",
    "avatar": "assets/images/avatars/6797d5973f992cc6f45ddddb.png"
  },
  {
    "name": "Jan Verhelst",
    "date": "2025-01-25T15:05:12.000Z",
    "stars": 4,
    "title": "Flexible software with quite a lot of…",
    "text": "Flexible software with quite a lot of possibilities. The learning curve as a total noob is pretty high but you get some wonderful help and support. Even as a complete amateur you can make some good money.",
    "avatar": "assets/images/avatars/6794e17dd4dc7fe8ab6af3dd.png"
  },
  {
    "name": "Mara Ledezma",
    "date": "2025-01-21T07:46:01.000Z",
    "stars": 5,
    "title": "Highly recommended!",
    "text": "Since day one, they’ve been fully invested and genuinely excited about my projects. The value they provide is exceptional. I was cautious initially because their claims seemed bold, but they have consistently over-delivered and continue to improve. Their customer support is the best I’ve ever encountered, always responsive and helpful. The training is not only effective but also fun, thoughtful, and clear. I can’t say enough good things about them. Highly recommended!",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Jarrad Clark",
    "date": "2025-01-19T00:06:36.000Z",
    "stars": 5,
    "title": "It’s only day one but so far these guys…",
    "text": "It’s only day one but so far these guys have been on the ball, have a level of taste that’s nuanced enough for my world and quick and quiet enough get shit fine -",
    "avatar": "assets/images/avatars/678c25e3fb43697f75d0b303.png"
  },
  {
    "name": "Sabastian Huynh",
    "date": "2025-01-17T00:23:54.000Z",
    "stars": 5,
    "title": "they care about my success...",
    "text": "I have been in the \"game\"/online marketing, etc for over 15yrs, I have bought more subscriptions then I remembered I had.  Not only is everything in one place, I have cancelled my email responder, calendar, other crm, etc and saved over $500+ a month.  Ken Marquez followed up with my onboarding and confirmed everything is working with the migration of my websites, email drips, calendar, etc...  this is the first time I felt a company cared about my business and didn't just sell me a product for their own benefit.  seriously, i am the biggest champion of course creator 360, not because they are saving me over $500+ a month, they keep following up to assure my business is successful.  LOVE YOU GUYS....",
    "avatar": "assets/images/avatars/678986f5db4c634f18a3e746.png"
  },
  {
    "name": "Justin Hunt",
    "date": "2025-01-16T18:07:26.000Z",
    "stars": 5,
    "title": "Monthly Reoccurring Revenue IS Possible",
    "text": "Our company has never had MRR. Thanks to Course Creator 360 -- and A TON of Course Creator Pro videos -- that has changed in 2025. We had a successful prelaunch. 53% purchased our low ticket offer and 10% purchased our high ticket offer.Everything you need to know/do is right here.",
    "avatar": "assets/images/avatars/67892ea6e9ce38841a61f515.png"
  },
  {
    "name": "Devin Robinson",
    "date": "2025-01-06T13:04:07.000Z",
    "stars": 5,
    "title": "Stockton really has created a great…",
    "text": "Stockton really has created a great product, but not only that, he has created an AMAZING community with the best customer support. He is ALL in and you can tell he's committed to it. Very good!",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Christine Price",
    "date": "2025-01-03T18:08:53.000Z",
    "stars": 5,
    "title": "Course Creator 360 is ALL YOU NEED!",
    "text": "I have taken course after course after course.  Stockton is just AMAZING, as his team and community.  No question ever goes unanswered and he overdelivers on a daily basis.  If you are looking to build a course online, USE THIS ONE!  I've tried at least 5 others and nothing else compares.",
    "avatar": "assets/images/avatars/672e1b8befae23248dbf32b8.png"
  },
  {
    "name": "Lucas Peinador",
    "date": "2024-12-30T15:01:57.000Z",
    "stars": 5,
    "title": "Soooooooo Much Value!",
    "text": "Soooooooo Much Value!I have used plenty of software to make my business work. And CC360 has replaced all of them. Not only that, but they haven't stopped adding new and better features to the software since they released it. I love these guys!",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Adam Jordan",
    "date": "2024-12-24T03:46:54.000Z",
    "stars": 5,
    "title": "Been using CC 360 for a full month now…",
    "text": "Been using Course Creator 360 for a full month now (after 8 years of a different platform - Kajabi) and the customer service on CC360 is so ridiculously good.  I love the experience so far.",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Jessica Woffinden",
    "date": "2024-12-23T21:38:47.000Z",
    "stars": 5,
    "title": "Stockton and his team always…",
    "text": "Stockton and his team always overdeliver. You will NOT be disappointed in purchasing this course! There is so much value here and they believe in you, regardless of how inexperienced you feel. They will walk you through step by step how to succeed, and the community here can help answer questions/issues you may run into :)",
    "avatar": "assets/images/avatars/6769bc3feba2ec94e4bc6b94.png"
  },
  {
    "name": "Jess Reynolds",
    "date": "2024-12-22T05:23:12.000Z",
    "stars": 5,
    "title": "Best CRM out there for course creators!",
    "text": "You name the CRM or course hosting platform, I've tried it.  CC360 is bar none the best!  Everything I need in one place, and new features all the time.  Plus a terrific community of people!  I've been using CC350 now for almost 2 years, it is amazing.",
    "avatar": "assets/images/avatars/67678619765b7a577631b8bd.png"
  },
  {
    "name": "Eric Jong",
    "date": "2024-12-21T00:21:09.000Z",
    "stars": 1,
    "title": "Migration service is terrible",
    "text": "This review relates in particular to my experience of the ‘Done for you migration’. I was initially led to believe that this would be no problem at all, everything was possible and would be done in just 7-10 days...well here I am 7 weeks later and I've given up on the 'not-done-very-well-for-you migration' and hired a competent freelancer to finish the job off.My experience has been super frustrating. I was let down time and time again in terms of quality, reliability, and communication. There were no processes in place whatsoever, no clear roadmap, a lack of professionalism and skills - and as a result plenty of targets were missed and mistakes made.Worst of all though was the amount of time I ended up having to spend on it...I was left to basically manage the project, communicating with a 'team' of people  who were incredibly unprofessional and lacked skills too.I wanted to discuss my experience and offered to provide feedback to Stockton as a courtesy before posting this review. Expecting any business owner to show an interest in learning and improving, I was met instead with a very inflexible schedule and no real willingness to make use of this offer. It seems to me he doesn't really care, and just palms the migrations off to a 2nd rate team of freelancers who have no processes to follow, very little knowledge and training in the tasks they need to do, and terrible customer service (besides saying sorry a lot, which doesn't count for much after a while).As excited as I was about this service at the start of this process I honestly cannot recommend the ‘Done for you migration service’ on offer here. If you have an existing online course business running on other software and think it will be an easy move across to CC360 with the 'done for you migration' ...think again...it was an absolute shambles!",
    "avatar": "assets/images/avatars/6765edc47651373bea5cec2e.png"
  },
  {
    "name": "Jacyn Siebert",
    "date": "2024-12-20T18:02:03.000Z",
    "stars": 5,
    "title": "They have thought of everything.",
    "text": "They have thought of everything! This is the most comprehensive, thorough, easy-to-learn, and launch system. It is designed for speed and offers extensively advanced features, funnels, and tools within the product to replace numerous other software subscriptions. The customer service and coaching support is exceptional, ultra-responsive, and very supportive. This is the most valuable purchase I have discovered to date! I highly recommend it!",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Chad Butler",
    "date": "2024-12-20T17:58:36.000Z",
    "stars": 5,
    "title": "Switched from Kajabi… Should have switched sooner",
    "text": "I switched from Kajabi after spending weeks trying to figure out how to build my course offer there. My only regret is that I didn’t move sooner.In my opinion the biggest value is the educational content that helps walk you through every step of the process. Finding CC360 was a game changer for me.The support is excellent. I’m always able to speak with a live person when needed. I’ve had them create custom videos for me to explain how to do something I was blocked on.",
    "avatar": "assets/images/avatars/6765940c7fa771158121c353.png"
  },
  {
    "name": "Mustafa Kamaliddin",
    "date": "2024-12-20T17:43:11.000Z",
    "stars": 5,
    "title": "I was a member from the very beginning",
    "text": "I was a member from the very beginning. It consolidated a lot of services into a single software for a much cheaper price. Ever since, we've had a gazillion updates and new features further enhancing the value of the subscription. All my websites and funnels are done through cc360 alongside my CRM needs...highly recommend it...cannot stress enough how awesome this software is. It is the definition of 'no brainer' deals...the very best",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Janice  L",
    "date": "2024-12-20T17:20:05.000Z",
    "stars": 5,
    "title": "Best Resource for FUNNELS",
    "text": "The best Funnel resource I have ever received. This community is absolutely amazing! The onboarding process was engaging and easy to understand. I highly encourage anyone reading this to take action and join this community.",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Håkon Andersen",
    "date": "2024-12-20T17:18:16.000Z",
    "stars": 5,
    "title": "Awesome software and fantastic customer…",
    "text": "Awesome software and fantastic customer support. The team in CC360 are always supportive and overdeliver!",
    "avatar": "assets/images/avatars/67658ab376513781185ca4bd.png"
  },
  {
    "name": "Heather Esposito",
    "date": "2024-12-14T14:13:03.000Z",
    "stars": 5,
    "title": "The Product is Fantastic AND the Customer Service is Beyond AMAZING!",
    "text": "I switched over to CC360 a month ago from another platform I'd been on for 6 years and have been BLOWN-AWAY!The platform itself is fantastic, Stockton and his team has created an AMAZING product AND...the Customer Support outshines it all.It is so nice to get help with something in REAL TIME with a REAL HUMAN. I loathe having to search an article base for my problem ~ if you don't say it in the way the article says it, you can be screwed searching for an answer for hours.Not with CC360 ~ help is right at your fingertips! They are the epitomy of \"support\" as they will do everything they can to resolve the issue.I'm loving my experience so far and look forward to years together with CC360!",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Myke",
    "date": "2024-12-11T16:32:16.000Z",
    "stars": 5,
    "title": "Excellent information!",
    "text": "Excellent information!I've made more meaningful progress on my business infostructure in the last week than I did in a year! I had put off doing various activities to build out my product offerings because I felt like I didn't understand how to do it all on my own. This isn't strategy and marketing stuff - it is essential technical connectivity.The thing that could easily be taken for granted is the quality of the video editing. I'm used to watching video content at 1.7 - 2X speeds. I can't do that with these videos because there really is no fluff. Even some info that would be helpful is taken out(!) but it has allowed me to poke around inside the software more myself to try to understand it better. I have had to connect with customer service for a couple of issues, which I caused myself - and everything has been addressed within 24hrs.",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Derrik Schweppe",
    "date": "2024-12-10T03:47:11.000Z",
    "stars": 5,
    "title": "Saved us over $7,000 a month!",
    "text": "Course Creator 360 legitimately saved our company of $7,000/MONTH just from our CRM. Thats not included the many other services we were able to cancel and save money on. Stockton and the team are incredibly responsive, supportive, and just magical humans. 10/10 experience. It's so good I feel like I'm stealing from them.",
    "avatar": "assets/images/avatars/6614085592f783001208f394.png"
  },
  {
    "name": "Max Sanderson",
    "date": "2024-12-03T04:16:55.000Z",
    "stars": 5,
    "title": "Great response",
    "text": "I had trouble logging in, and it turned out it was my fault as I had entered an old email by mistake. The team handled the situation so well and sorted the problem out.This sounds like a small detail, but it’s not. There are lots of courses I’ve joined where you don’t even hear back from them… so it a great start! :)",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  },
  {
    "name": "Courtney Gore SMith",
    "date": "2024-12-01T20:27:14.000Z",
    "stars": 5,
    "title": "The support is incredible",
    "text": "The support is incredible. The software offerings are so impressive this is heaven sent to have everything you need to run your business at your fingertips under one roof. I've had to use technical support for assistance, and they were fantastic.",
    "avatar": "assets/images/avatars/avatar-placeholder.svg"
  }
]